
--
-- 表的结构 `cdb_rankgroup`
--

CREATE TABLE IF NOT EXISTS `cdb_rankgroup` (
  `id` mediumint(8) unsigned NOT NULL auto_increment,
  `gid` smallint(6) unsigned NOT NULL default '0',
  `gname` varchar(30) NOT NULL,
  `rankid` smallint(6) unsigned NOT NULL COMMENT 'ranks表的rankid',
  `imgurl` varchar(75) NOT NULL,
  `closed` tinyint(1) unsigned NOT NULL default '1' COMMENT '是否关闭',
  PRIMARY KEY  (`id`),
  KEY `gid` (`gid`,`rankid`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 AUTO_INCREMENT=56 ;

--
-- 导出表中的数据 `cdb_rankgroup`
--

INSERT INTO `cdb_rankgroup` (`id`, `gid`, `gname`, `rankid`, `imgurl`, `closed`) VALUES
(1, 0, '公司白领', 0, 'g1.gif', 1),
(2, 0, '魔法师', 0, 'g2.gif', 1),
(3, 0, '科举夺魁', 0, 'g3.gif', 1),
(4, 0, '武将', 0, 'g4.gif', 1),
(5, 0, '江湖奇侠', 0, 'g5.gif', 1),
(6, 1, '试用期', 1, '', 1),
(7, 1, '助理', 2, '', 1),
(8, 1, '经理', 3, '', 1),
(9, 1, '高级经理', 4, '', 1),
(10, 1, '总监', 5, '', 1),
(11, 1, '副总裁', 6, '', 1),
(12, 1, '首席运营官', 7, '', 1),
(13, 1, '首席执行官', 8, '', 1),
(14, 1, '董事长', 9, '', 1),
(15, 1, '商界领袖', 10, '', 1),
(16, 2, '魔法学徒', 1, '', 1),
(17, 2, '见习魔法师', 2, '', 1),
(18, 2, '魔法师', 3, '', 1),
(19, 2, '高级魔法师', 4, '', 1),
(20, 2, '大魔法师', 5, '', 1),
(21, 2, '魔导师', 6, '', 1),
(22, 2, '大魔导师', 7, '', 1),
(23, 2, '护国法师', 8, '', 1),
(24, 2, '魔神', 9, '', 1),
(25, 2, '魔界至尊', 10, '', 1),
(26, 3, '童生', 1, '', 1),
(27, 3, '秀才', 2, '', 1),
(28, 3, '举人', 3, '', 1),
(29, 3, '同进士出身', 4, '', 1),
(30, 3, '进士出身', 5, '', 1),
(31, 3, '探花', 6, '', 1),
(32, 3, '榜眼', 7, '', 1),
(33, 3, '状元', 8, '', 1),
(34, 3, '大学士', 9, '', 1),
(35, 3, '翰林文圣', 10, '', 1),
(36, 4, '兵卒', 1, '', 1),
(37, 4, '门吏', 2, '', 1),
(38, 4, '千总', 3, '', 1),
(39, 4, '都司', 4, '', 1),
(40, 4, '参将', 5, '', 1),
(41, 4, '总兵', 6, '', 1),
(42, 4, '护军统领', 7, '', 1),
(43, 4, '九门提督', 8, '', 1),
(44, 4, '骠骑将军', 9, '', 1),
(45, 4, '天下兵马大都督', 10, '', 1),
(46, 5, '初学弟子', 1, '', 1),
(47, 5, '初入江湖', 2, '', 1),
(48, 5, '江湖新秀', 3, '', 1),
(49, 5, '江湖少侠', 4, '', 1),
(50, 5, '江湖大侠', 5, '', 1),
(51, 5, '江湖豪侠', 6, '', 1),
(52, 5, '一派掌门', 7, '', 1),
(53, 5, '一代宗师', 8, '', 1),
(54, 5, '武林盟主', 9, '', 1),
(55, 5, '独孤求败', 10, '', 1);
